#Файл game.py - основний файл, який запускається для гри.

'''
- Містить блок на перевірку імені модуля (main)
- В середині if блок try/except.
- try запускає функцію play()
- except обробляє два винятки:
  - GameOver - виводить на екран повідомлення про завершення гри, записує результат в таблицю рекордів.
  - KeyboardInterrupt - pass.
- finally виводить на екран "Good bye!" '''


def play():
    '''
- Гравець вводить ім'я
- Створюється об'єкт player
- level = 1
- Створюється об'єкт enemy.
- В бескінечному циклі викликаються методи attack та defence об'єкту player
- при виникненні винятку EnemyDown підвищує рівень гри на 1, створює новий об'єкт Enemy з новим рівнем '''
    pass